twittergram/app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sdfgsdfg"], ["user_id", 1], ["created_at", "2017-09-12 12:51:05.478623"], ["updated_at", "2017-09-12 12:51:05.478623"]]

    def set_post
      @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]